<a href="https://colab.research.google.com/github/AnhVietPham/Computer-Science/blob/master/research-pandas/Pandas_GroupBy_Count_sort_values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **How to Use Pandas GroupBy, Counts and Value Counts**
https://www.kite.com/blog/python/pandas-groupby-count-value-count/

In [1]:
import pandas as pd
import numpy as np

url = 'https://gist.githubusercontent.com/alexdebrie/b3f40efc3dd7664df5a20f5eee85e854/raw/ee3e6feccba2464cbbc2e185fb17961c53d2a7f5/stocks.csv'

In [2]:
df = pd.read_csv(url)
df

          date symbol     open     high      low    close    volume
0   2019-03-01   AMZN  1655.13  1674.26  1651.00  1671.73   4974877
1   2019-03-04   AMZN  1685.00  1709.43  1674.36  1696.17   6167358
2   2019-03-05   AMZN  1702.95  1707.80  1689.01  1692.43   3681522
3   2019-03-06   AMZN  1695.97  1697.75  1668.28  1668.95   3996001
4   2019-03-07   AMZN  1667.37  1669.75  1620.51  1625.95   4957017
5   2019-03-01   AAPL   174.28   175.15   172.89   174.97  25886167
6   2019-03-04   AAPL   175.69   177.75   173.97   175.85  27436203
7   2019-03-05   AAPL   175.94   176.00   174.54   175.53  19737419
8   2019-03-06   AAPL   174.67   175.49   173.94   174.52  20810384
9   2019-03-07   AAPL   173.87   174.44   172.02   172.50  24796374
10  2019-03-01   GOOG  1124.90  1142.97  1124.75  1140.99   1450316
11  2019-03-04   GOOG  1146.99  1158.28  1130.69  1147.80   1446047
12  2019-03-05   GOOG  1150.06  1169.61  1146.19  1162.03   1443174
13  2019-03-06   GOOG  1162.49  1167.57  1155.49  1157.86   1099289
14  2019-03-07   GOOG  1155.72  1156.76  1134.91  1143.30   1166559

# **Basic Pandas groupby usage**

In [5]:
symbols = df.groupby('symbol')
print(symbols.groups)

{'AAPL': [5, 6, 7, 8, 9], 'AMZN': [0, 1, 2, 3, 4], 'GOOG': [10, 11, 12, 13, 14]}

In [8]:
def increased(idx):
  print(df.loc[idx])
  return df.loc[idx].close > df.loc[idx].open

df.groupby(increased).groups

date      2019-03-01
symbol          AMZN
open         1655.13
high         1674.26
low             1651
close        1671.73
volume       4974877
Name: 0, dtype: object
date      2019-03-04
symbol          AMZN
open            1685
high         1709.43
low          1674.36
close        1696.17
volume       6167358
Name: 1, dtype: object
date      2019-03-05
symbol          AMZN
open         1702.95
high          1707.8
low          1689.01
close        1692.43
volume       3681522
Name: 2, dtype: object
date      2019-03-06
symbol          AMZN
open         1695.97
high         1697.75
low          1668.28
close        1668.95
volume       3996001
Name: 3, dtype: object
date      2019-03-07
symbol          AMZN
open         1667.37
high         1669.75
low          1620.51
close        1625.95
volume       4957017
Name: 4, dtype: object
date      2019-03-01
symbol          AAPL
open          174.28
high          175.15
low           172.89
close         174.97
volume      25886167
Name: 5, dtype: object
date      2019-03-04
symbol          AAPL
open          175.69
high          177.75
low           173.97
close         175.85
volume      27436203
Name: 6, dtype: object
date      2019-03-05
symbol          AAPL
open          175.94
high             176
low           174.54
close         175.53
volume      19737419
Name: 7, dtype: object
date      2019-03-06
symbol          AAPL
open          174.67
high          175.49
low           173.94
close         174.52
volume      20810384
Name: 8, dtype: object
date      2019-03-07
symbol          AAPL
open          173.87
high          174.44
low           172.02
close          172.5
volume      24796374
Name: 9, dtype: object
date      2019-03-01
symbol          GOOG
open          1124.9
high         1142.97
low          1124.75
close        1140.99
volume       1450316
Name: 10, dtype: object
date      2019-03-04
symbol          GOOG
open         1146.99
high         1158.28
low          1130.69
close         1147.8
volume       1446047
Name: 11, dtype: object
date      2019-03-05
symbol          GOOG
open         1150.06
high         1169.61
low          1146.19
close        1162.03
volume       1443174
Name: 12, dtype: object
date      2019-03-06
symbol          GOOG
open         1162.49
high         1167.57
low          1155.49
close        1157.86
volume       1099289
Name: 13, dtype: object
date      2019-03-07
symbol          GOOG
open         1155.72
high         1156.76
low          1134.91
close         1143.3
volume       1166559
Name: 14, dtype: object

{False: [2, 3, 4, 7, 8, 9, 13, 14], True: [0, 1, 5, 6, 10, 11, 12]}

In [10]:
df.groupby('symbol').count().reset_index()

  symbol  date  open  high  low  close  volume
0   AAPL     5     5     5    5      5       5
1   AMZN     5     5     5    5      5       5
2   GOOG     5     5     5    5      5       5

# **pandas.DataFrame.sort_values**

In [35]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C', 'E'],
    'col2': [2, 1, 9, 8, 7, 4, 2],
    'col3': [0, 1, 9, 4, 2, 3, 9],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F', 'G']
})
df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
6    E     2     9    G

In [36]:
get_data = df[df["col2"] == 2]
get_data

  col1  col2  col3 col4
0    A     2     0    a
6    E     2     9    G

In [19]:
df.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [20]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [21]:
df.sort_values(by=['col2'], ascending=False)

  col1  col2  col3 col4
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
0    A     2     0    a
1    A     1     1    B

In [23]:
df.sort_values(by=['col2'], ascending=False)

  col1  col2  col3 col4
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
0    A     2     0    a
1    A     1     1    B